cylinder_re500/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          160;
        startFace       148182;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       148342;
    }
    top
    {
        type            patch;
        nFaces          300;
        startFace       148502;
    }
    bottom
    {
        type            patch;
        nFaces          300;
        startFace       148802;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          111644;
        startFace       149102;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          912;
        startFace       260746;
    }
)

// ************************************************************************* //
