cylinder_re500/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
    (-4 -4 0)
    (11 -4 0)
    (11  4 0)
    (-4  4 0)
    (-4 -4 0.1)
    (11 -4 0.1)
    (11  4 0.1)
    (-4  4 0.1)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (300 160 1) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet   { type patch; faces ((0 4 7 3)); }
    outlet  { type patch; faces ((1 2 6 5)); }
    top     { type patch; faces ((3 7 6 2)); }
    bottom  { type patch; faces ((0 1 5 4)); }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
